---
type: TransformWithBoundary
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# TransformWithBoundary

`Autodesk.Revit.DB.TransformWithBoundary` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TransformWithBoundary | 2021 | `public TransformWithBoundary ( TransformWithBoundary other )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBoundary | 2023 | `public CurveLoop GetBoundary ()` |
| Method | GetModelToProjectionTransform | 2023 | `public Transform GetModelToProjectionTransform ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |